data/google/gke/gpu/32/node-12/raw/sysbench-fileio-run-file-test-modeseqwr
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential write (creation) test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     10510.93
    fsyncs/s:                     13458.09

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               164.23

General statistics:
    total time:                          10.0070s
    total number of events:              239769

Latency (ms):
         min:                                    0.01
         avg:                                    0.04
         max:                                   26.24
         95th percentile:                        0.04
         sum:                                 9944.94

Threads fairness:
    events (avg/stddev):           239769.0000/0.00
    execution time (avg/stddev):   9.9449/0.00